Revit 2026 API

# ParameterValueIsEqual Method

---

Tests equality with another instance of the same class.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsEqual(
	ParameterValue other
)
```
```vb
Public Function IsEqual (
	other As ParameterValue
) As Boolean
```
```cpp
public:
bool IsEqual(
	ParameterValue^ other
)
```
```fsharp
member IsEqual :
        other : ParameterValue -> bool
```

#### Parameters

other ParameterValue
     The instance to compare with

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The result is always False if the two comparands are of a different value types.

#### Reference

ParameterValue Class

Autodesk.Revit.DB Namespace